tap "perryts/perry", "https://github.com/PerryTS/homebrew-perry"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Agent multiplexer that lives in your terminal
brew "herdr"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Next-gen compiler infrastructure
brew "llvm"
# Text-based web browser
brew "lynx"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Fast, disk space efficient package manager
brew "pnpm"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql@17"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Command-line tool to customize Spotify client
brew "spicetify-cli"
# Command driven spotify player
brew "spotify_player"
# User interface to the TELNET protocol
brew "telnet"
# Parser generator tool
brew "tree-sitter-cli"
# Your CLI home video recorder
brew "vhs"
# Tracks most-used directories to make cd smarter
brew "z"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Native TypeScript compiler — compiles TypeScript to native executables
brew "perryts/perry/perry", trusted: true
# Display management tool
cask "betterdisplay"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# GPU-based terminal emulator
cask "kitty"
# Replacement for Docker Desktop
cask "orbstack"
# Rust-based terminal
cask "warp"
npm "@earendil-works/pi-coding-agent"
npm "corepack"
npm "hunkdiff"
npm "vlt"
